Tekla Open API Reference for Tekla Structures 2025
Offset Fields
The RebarSpacing.Offset type exposes the following members.
Fields
Name | Description
Automatic
 Defines whether the offset distance is to be automatically calculated.
Distance
 The distance.
Type
 Defines whether the distance is intended as a fixed or a minimum distance.
Top
See Also
Reference
RebarSpacing.Offset Structure
Tekla.Structures.Model Namespace